tap "supabase/tap"
tap "xykong/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# General-purpose data compression with high compression ratio
brew "xz"
# Python code formatter
brew "black"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Go formatter that additionally inserts import statements
brew "goimports"
# Tool for glamorous shell scripts
brew "gum"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Prettier daemon
brew "prettierd"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Autoformat shell script source code
brew "shfmt"
# Shell script static analysis tool
brew "shellcheck"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Supabase CLI
brew "supabase/tap/supabase", trusted: true
# tldr: simplified and community-driven man pages
brew "tldr"
# Opeencode
brew "anomalyco/tap/opencode", trusted: true
# pnpm: fast, disk space efficient package manager
brew "pnpm"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Window peeking utility app
cask "dockdoor"
# Markdown previews in Finder QuickLook with diagrams and math
cask "xykong/tap/flux-markdown", trusted: true
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Customise mouse behavior
cask "linearmouse"
npm "corepack"
